btheobald/swansong/gliderxl/gliderxl.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Core/Src
PB13.GPIOParameters=GPIO_Label
PA6.Mode=Single Bank 1
RCC.USART1Freq_Value=16000000
SH.S_TIM1_CH4.0=TIM1_CH4,PWM Generation4 CH4
RCC.SAI1Freq_Value=16000000
RCC.CortexFreq_Value=16000000
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.VirtualType=VM_MASTER
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G484RETx
VP_TIM20_VS_no_output6.Signal=TIM20_VS_no_output6
ADC2.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_15
PC2.Stacked=true
PC12.Locked=true
TIM1.IPParameters=Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Channel-PWM Generation1 CH1
PC10.Signal=SPI3_SCK
PC12.Signal=UART5_TX
PB14.GPIO_Label=Battery Current Sense
PC5.Locked=true
PC7.Locked=true
PA0.GPIO_Label=HPS_B_TIM2_CH1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC5_Init-ADC5-false-HAL-true,4-MX_OPAMP3_Init-OPAMP3-false-HAL-true,5-MX_OPAMP5_Init-OPAMP5-false-HAL-true,6-MX_QUADSPI1_Init-QUADSPI1-false-HAL-true,7-MX_SPI3_Init-SPI3-false-HAL-true,8-MX_TIM8_Init-TIM8-false-HAL-true,9-MX_USB_PCD_Init-USB-false-HAL-true,10-MX_ADC2_Init-ADC2-false-HAL-true
PC3.Locked=true
PA11.Mode=Device
PC9.Locked=true
PB6.GPIO_Label=GPS_USART1_TX
RCC.USART2Freq_Value=16000000
TIM8.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PD2.Locked=true
PD2.GPIOParameters=GPIO_Label
SH.S_TIM1_CH3.ConfNb=1
SH.S_TIM1_CH1.ConfNb=1
PC13.GPIO_Label=GPS_RESET
PC1.Locked=true
PB13.GPIO_Label=Battery Voltage Sense
VREF+.Locked=true
PB11.Signal=S_TIM2_CH4
PB13.Signal=OPAMP4_VINP
PB15.Signal=ADC2_IN15
PC15-OSC32_OUT.GPIO_Label=GPS_EXT_INT
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=16000000
RCC.LPTIM1Freq_Value=16000000
Mcu.IP4=OPAMP4
Mcu.IP5=QUADSPI1
RCC.FCLKCortexFreq_Value=16000000
PC7.Stacked=true
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=OPAMP2
PA15.GPIO_Label=SD_NCS
Mcu.IP0=ADC2
Mcu.IP1=DAC3
PA12.Signal=USB_DP
Mcu.UserConstants=
SH.S_TIM3_CH2.ConfNb=1
VP_DAC3_VS_DACI1.Signal=DAC3_VS_DACI1
Mcu.ThirdPartyNb=0
TIM1.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
RCC.HCLKFreq_Value=16000000
RCC.I2C4Freq_Value=16000000
TIM8.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.IPNb=13
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=16000000
PB6.Signal=USART1_TX
PC7.Signal=S_TIM8_CH2
PC3.Signal=S_TIM1_CH4
Mcu.Pin6=PC1
Mcu.Pin7=PC2
Mcu.Pin8=PC3
Mcu.Pin9=PA0
RCC.AHBFreq_Value=16000000
PB13.Locked=true
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
TIM8.IPParameters=Channel-PWM Generation4 CH4,Channel-PWM Generation3 CH3,Channel-PWM Generation2 CH2,Channel-PWM Generation1 CH1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15-OSC32_OUT
VREF+.Signal=VREFBUF_OUT
Mcu.Pin3=PF0-OSC_IN
RCC.USART3Freq_Value=16000000
Mcu.Pin4=PF1-OSC_OUT
Mcu.Pin5=PC0
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB2.Signal=GPIO_Input
PB3.Mode=Trace_Asynchronous_SW
PA8.Locked=true
PA4.Locked=true
Mcu.IP10=TIM8
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USB
Mcu.IP11=TIM20
PC8.Stacked=true
PB12.GPIO_Label=HPS Current Sense A
VP_DAC3_VS_DACI1.Mode=DAC_OUT1_Int
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.3.0
MxDb.Version=DB.6.0.10
PA1.GPIOParameters=GPIO_Label
PB4.Mode=Full_Duplex_Master
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=16000000
PC4.GPIO_Label=NAV_STAT_0
TIM1.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PA14.Mode=Trace_Asynchronous_SW
PB14.Mode=Follower_Internally_Connected
PC11.GPIO_Label=IMU_CS
PB5.Mode=Full_Duplex_Master
File.Version=6
PA10.GPIO_Label=RADIO_SET
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
SH.S_TIM2_CH1.ConfNb=1
PB7.Signal=USART1_RX
PA8.Signal=I2C2_SDA
RCC.PLLRCLKFreq_Value=64000000
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC0.Stacked=true
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
SH.S_TIM8_CH1.ConfNb=1
PC14-OSC32_IN.GPIOParameters=GPIO_Label
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=gliderxl
PA0.Signal=S_TIM2_CH1
SH.S_TIM8_CH3.ConfNb=1
PB7.GPIO_Label=GPS_USART1_RX
Mcu.Package=LQFP64
PB9.Signal=GPIO_Output
PB1.Signal=QUADSPI1_BK1_IO0
PA6.Signal=QUADSPI1_BK1_IO3
TIM8.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
SH.S_TIM8_CH4.0=TIM8_CH4,PWM Generation4 CH4
SPI3.Mode=SPI_MODE_MASTER
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
TIM20.Channel-Output\ Compare6\ No\ Output=TIM_CHANNEL_6
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
PA10.Signal=GPIO_Output
TIM8.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PA15.Signal=GPIO_Output
ADC2.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
PB14.GPIOParameters=GPIO_Label
TIM20.IPParameters=Channel-Output Compare6 No Output
RCC.PLLPoutputFreq_Value=64000000
RCC.APB1TimFreq_Value=16000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.Locked=true
RCC.LPUART1Freq_Value=16000000
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
PC14-OSC32_IN.GPIO_Label=GPS_FORCEON
PC5.Signal=GPIO_Output
PB13.Mode=Follower_Internally_Connected
PC15-OSC32_OUT.GPIOParameters=GPIO_Label
SH.S_TIM2_CH4.ConfNb=1
ADC2.Rank-0\#ChannelRegularConversion=1
PF1-OSC_OUT.Mode=HSE-External-Oscillator
PA4.GPIO_Label=BUZZER_TIM3_CH2
PB6.Stacked=true
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
PC14-OSC32_IN.Locked=true
PF1-OSC_OUT.Signal=RCC_OSC_OUT
RCC.HSI48_VALUE=48000000
PB15.Locked=true
PB4.Signal=SPI3_MISO
RCC.HRTIM1Freq_Value=16000000
PA3.Signal=QUADSPI1_CLK
SH.S_TIM8_CH3.0=TIM8_CH3,PWM Generation3 CH3
PA2.Locked=true
RCC.I2SFreq_Value=16000000
RCC.PLLQoutputFreq_Value=64000000
ProjectManager.ProjectFileName=gliderxl.ioc
SH.S_TIM2_CH1.0=TIM2_CH1
PC6.Stacked=true
PA7.Mode=Single Bank 1
PB9.GPIO_Label=IMU_INT
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=53
ProjectManager.NoMain=false
PC11.Locked=true
PC13.Locked=true
PC13.Signal=GPIO_Output
PC11.Signal=GPIO_Output
PC8.Signal=S_TIM8_CH3
PC2.Signal=S_TIM1_CH3
PC4.Signal=GPIO_Output
PC6.Signal=S_TIM8_CH1
PC10.Mode=Full_Duplex_Master
PB11.GPIO_Label=HPS_A_TIM2_CH4
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB7.Stacked=true
PC0.Signal=S_TIM1_CH1
PB14.Locked=true
PC14-OSC32_IN.Signal=GPIO_Output
PC11.GPIOParameters=GPIO_Label
RCC.QSPIFreq_Value=16000000
SH.S_TIM8_CH2.0=TIM8_CH2,PWM Generation2 CH2
RCC.FamilyName=M
PC9.Stacked=true
PB9.GPIOParameters=GPIO_Label
PC12.GPIOParameters=GPIO_Label
PA3.Mode=Single Bank 1
PA13.Signal=SYS_JTMS-SWDIO
PA15.Locked=true
PC15-OSC32_OUT.Locked=true
SH.S_TIM1_CH1.0=TIM1_CH1,PWM Generation1 CH1
ProjectManager.TargetToolchain=EWARM V8.32
Mcu.Pin51=VP_SYS_VS_DBSignals
Mcu.Pin52=VP_TIM20_VS_no_output6
Mcu.Pin50=VP_SYS_VS_Systick
PB7.GPIOParameters=GPIO_Label
ADC2.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag
PC5.GPIOParameters=GPIO_Label
PC6.Locked=true
PB2.GPIOParameters=GPIO_Label
PA9.Signal=I2C2_SCL
TIM1.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PB11.GPIOParameters=GPIO_Label
PB5.Locked=true
PB9.Locked=true
PC2.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=64000000
RCC.LSE_VALUE=32768
PC15-OSC32_OUT.Signal=GPIO_Output
PA1.Signal=OPAMP3_VINP
Mcu.Pin48=PB9
Mcu.Pin49=VP_DAC3_VS_DACI1
Mcu.Pin46=PB6
PF0-OSC_IN.Mode=HSE-External-Oscillator
SH.S_TIM1_CH2.ConfNb=1
Mcu.Pin47=PB7
SH.S_TIM8_CH4.ConfNb=1
PB14.Signal=OPAMP2_VINP
Mcu.Pin40=PC11
SH.S_TIM3_CH2.0=TIM3_CH2
Mcu.Pin41=PC12
ADC2.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1
Mcu.Pin44=PB4
PB0.Mode=Single Bank 1
Mcu.Pin45=PB5
Mcu.Pin42=PD2
board=custom
Mcu.Pin43=PB3
RCC.VCOOutputFreq_Value=128000000
ProjectManager.LastFirmware=true
PB15.Mode=IN15-Single-Ended
VP_TIM20_VS_no_output6.Mode=Output Compare6 No Output
RCC.APB2Freq_Value=16000000
RCC.UART4Freq_Value=16000000
SPI3.CalculateBaudRate=8.0 MBits/s
MxCube.Version=6.1.1
Mcu.Pin37=PA14
Mcu.Pin38=PA15
SH.S_TIM1_CH2.0=TIM1_CH2,PWM Generation2 CH2
PB15.GPIO_Label=Battery Temperature Sense
Mcu.Pin35=PA12
RCC.I2C1Freq_Value=16000000
Mcu.Pin36=PA13
PC13.GPIOParameters=GPIO_Label
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
RCC.FDCANFreq_Value=16000000
Mcu.Pin39=PC10
RCC.RNGFreq_Value=64000000
Mcu.Pin30=PC9
PA1.GPIO_Label=HPS Current Sense B
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=PA10
Mcu.Pin34=PA11
Mcu.Pin31=PA8
Mcu.Pin32=PA9
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
RCC.UART5Freq_Value=16000000
PB15.GPIOParameters=GPIO_Label
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HRTIM1Freq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G484RETx
Mcu.Pin26=PB15
Mcu.Pin27=PC6
PA2.Signal=QUADSPI1_BK1_NCS
Mcu.Pin24=PB13
ProjectManager.UnderRoot=false
Mcu.Pin25=PB14
PB2.Locked=true
Mcu.IP8=SYS
Mcu.IP9=TIM1
Mcu.Pin28=PC7
Mcu.IP6=RCC
Mcu.Pin29=PC8
Mcu.IP7=SPI3
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=SYS_JTDO-SWO
PA4.Signal=S_TIM3_CH2
RCC.SYSCLKFreq_VALUE=16000000
Mcu.Pin22=PB11
PB5.Signal=SPI3_MOSI
Mcu.Pin23=PB12
PA1.Locked=true
Mcu.Pin20=PB2
Mcu.Pin21=VREF+
PA3.Locked=true
PA12.Mode=Device
PA10.Locked=true
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC5.GPIO_Label=NAV_STAT_1
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC12.GPIO_Label=RADIO_UART5_TX
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_DM
PA14.Signal=SYS_JTCK-SWCLK
PB2.GPIO_Label=I2C_EXT_INT
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PA7
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PC4
PB1.Mode=Single Bank 1
Mcu.Pin13=PA4
SH.S_TIM2_CH4.0=TIM2_CH4
SH.S_TIM1_CH3.0=TIM1_CH3,PWM Generation3 CH3
Mcu.Pin14=PA6
Mcu.Pin19=PB1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PC5
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB0
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA2
Mcu.Pin12=PA3
Mcu.Pin10=PA1
PB7.Locked=true
PA2.Mode=Single Bank 1
RCC.PWRFreq_Value=16000000
PC8.Locked=true
PC9.Signal=S_TIM8_CH4
PF0-OSC_IN.Signal=RCC_OSC_IN
TIM1.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PC1.Stacked=true
PD2.Signal=UART5_RX
RCC.I2C2Freq_Value=16000000
RCC.APB1Freq_Value=16000000
PB0.Signal=QUADSPI1_BK1_IO1
SH.S_TIM1_CH4.ConfNb=1
PC0.Locked=true
PB11.Locked=true
ProjectManager.DeviceId=STM32G484RETx
PC1.Signal=S_TIM1_CH2
PB12.GPIOParameters=GPIO_Label
SH.S_TIM8_CH2.ConfNb=1
PB12.Signal=OPAMP6_VINP
PD2.GPIO_Label=RADIO_UART5_RX
ProjectManager.LibraryCopy=0
PA7.Signal=QUADSPI1_BK1_IO2
